; =====================================
;		HANDCANNONS
; -------------------------------------

[IRI_Handcannon_CV X2WeaponTemplate]
FriendlyName="猎狐犬手炮"
FriendlyNamePlural="猎狐犬手炮"
BriefSummary="手炮在近距离造成毁灭性伤害，但弹药有限。"
TacticalText="<Bullet/> 手炮在近距离造成毁灭性伤害，但弹药有限。"
AbilityDescName="手炮"

[IRI_Handcannon_MG X2WeaponTemplate]
FriendlyName="线圈手炮"
FriendlyNamePlural="线圈手炮"
BriefSummary="由赏金猎人和武器匠尼克·福克斯设计的原型，纳斯手炮结合了传统的火药装填和磁加速线圈，实现了双重毁灭性打击。."
TacticalText="由赏金猎人和武器匠尼克·福克斯设计的原型，纳斯手炮结合了传统的火药装填和磁加速线圈，实现了双重毁灭性打击。<br/><Bullet/> 手炮在近距离造成毁灭性伤害，但弹药有限。"
AbilityDescName="手炮"

[IRI_Handcannon_BM X2WeaponTemplate]
FriendlyName="电浆手炮"
FriendlyNamePlural="电浆手炮"
BriefSummary="罗伯特·罗兹的奇思妙想：将高口径空尖弹穿过充满炽热蓝色等离子体的室中发射，期望部分等离子体能进入子弹中心空腔，并在击中目标时造成极端伤害。这听起来完全疯狂，似乎无法实现，但它做到了。"
TacticalText="罗伯特·罗兹的奇思妙想：将高口径空尖弹穿过充满炽热蓝色等离子体的室中发射，期望部分等离子体能进入子弹中心空腔，并在击中目标时造成极端伤害。这听起来完全疯狂，似乎无法实现，但它做到了。<br/><Bullet/> 手炮在近距离造成毁灭性伤害，但弹药有限。"
AbilityDescName="手炮"

[BreakthroughHandcannonDamage X2TechTemplate]
DisplayName="改进型手炮"
Summary="在先进弹药推进剂的突破下，我们能够增加手炮的枪口能量而不牺牲武器的可靠性，提高伤害输出+1。."

; =====================================
;		COVERT ACTION
; -------------------------------------

[IRI_CovertAction_BountyHunterTraining X2CovertActionTemplate]
ActionObjective="赏金猎人训练中"

[IRI_CovertAction_BountyHunterTraining_Narrative X2CovertActionNarrativeTemplate]
ActionName="赏金猎人训练"
ActionPreNarrative="如果你有一个有潜力的候选人，我可以帮你联系我们的一位在外的赏金猎人。也许他们可以被说服提供一些在职培训。感兴趣吗？"
ActionPostNarrative="看来你的受训人员给人留下了很深的印象。他们得到了一些毕业礼物。"

[IRI_CovertAction_BountyHunterTraining_Narrative_SK X2CovertActionNarrativeTemplate]
ActionName="赏金猎人训练中"
ActionPreNarrative="我们与赏金猎人中的一个有过接触。虽然潜行不是我们的行事风格，但我们欢迎任何与长老会作对的人。我们的建议是，你们的一个新兵成为赏金猎人的学徒，学习他们的所有技能。"
ActionPostNarrative="看到人们团结一致反对长老会的压迫，总是令人振奋。"

[IRI_CovertAction_BountyHunterTraining_Narrative_TM X2CovertActionNarrativeTemplate]
ActionName="赏金猎人训练中"
ActionPreNarrative="一个赏金猎人正在穿过我的追随者保护的领地，他们正在提供间谍和暗杀服务……但是要付钱的。也许，你们的新兵之一可以从中受益。本着相互合作的精神，我们愿意支付赏金猎人要求的赏金金。"
ActionPostNarrative="我们很乐意作为知识的传递者，为了我们的共同事业。"


[IRI_BH_BountyHunterTraining_StaffSlot X2StaffSlotTemplate]
EmptyText="菜鸟"
BonusText="在隐秘行动中"

[IRI_BH_BountyHunterTraining_StaffSlotReward X2RewardTemplate]
DisplayName="赏金猎人训练中"

[IRI_BH_BountyHunterTraining_CovertActionReward X2RewardTemplate]
DisplayName="赏金猎人训练中"

[IRI_BountyHunter_GTS_Unlock X2SoldierAbilityUnlockTemplate]
DisplayName="赏金猎人：难以追踪"
Summary="如果你一回合不攻击，夜幕的冷却时间将额外减少<Ability:IRI_BH_Untraceable_CooldownReduction/> 回合"

; =====================================
;		赏金猎人 CLASS
; -------------------------------------

[BountyHunter X2SoldierClassTemplate]
DisplayName = "赏金猎人"
ClassSummary = "赏金猎人擅长通过伏击和爆炸性攻击来消灭优先目标"

LeftAbilityTreeTitle = "收割者"
RightAbilityTreeTitle = "追猎者"
+AbilityTreeTitles = "收割者"
+AbilityTreeTitles = "追猎者"
+AbilityTreeTitles = "暗杀者"
+AbilityTreeTitles = "XCOM"

;RankNames
;ShortNames

;RankIcons
;RandomNickNames
;RandomNickNames_Female
;RandomNickNames_Male
;PhotoboothSoloBLines_Female
;PhotoboothSoloBLines_Male

+RandomNickNames = "Redrum"
+RandomNickNames = "Huntsman"
+RandomNickNames = "Bloodhound"
+RandomNickNames = "Owl"
+RandomNickNames = "Pathfinder"
+RandomNickNames = "Stalker"
+RandomNickNames = "Hired Gun"
+RandomNickNames = "Undertaker"
+RandomNickNames = "Vampire"
+RandomNickNames = "Outlaw"
+RandomNickNames = "Mercenary"
+RandomNickNames = "Bandit"

+RandomNickNames_Male = "Man in Black"

; =====================================
;		赏金猎人 CLASS - LWOTC
; -------------------------------------

[LWS_BountyHunter X2SoldierClassTemplate]
DisplayName = "赏金猎人"
ClassSummary = "赏金猎人擅长通过伏击和爆炸性攻击来消灭优先目标"

LeftAbilityTreeTitle = "收割者"
RightAbilityTreeTitle = "追猎者"
+AbilityTreeTitles = "收割者"
+AbilityTreeTitles = "追猎者"
+AbilityTreeTitles = "暗示者"
+AbilityTreeTitles = "XCOM"

;RankNames
;ShortNames

;RankIcons
;RandomNickNames
;RandomNickNames_Female
;RandomNickNames_Male
;PhotoboothSoloBLines_Female
;PhotoboothSoloBLines_Male

+RandomNickNames = "Redrum"
+RandomNickNames = "Huntsman"
+RandomNickNames = "Bloodhound"
+RandomNickNames = "Owl"
+RandomNickNames = "Pathfinder"
+RandomNickNames = "Stalker"
+RandomNickNames = "Hired Gun"
+RandomNickNames = "Undertaker"
+RandomNickNames = "Vampire"
+RandomNickNames = "Outlaw"
+RandomNickNames = "Mercenary"
+RandomNickNames = "Bandit"
+RandomNickNames = "Rogue"

+RandomNickNames_Male = "黑衣人"


